experiments/results/thesis/DPFS-URING-tmpfs-waiting-new/fio_randwrite_4k_32_1.out
"randwrite_4k_32_1": (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=32
fio-3.28
Starting 1 thread

"randwrite_4k_32_1": (groupid=0, jobs=1): err= 0: pid=30276: Thu Aug  3 00:16:08 2023
  write: IOPS=58.0k, BW=227MiB/s (238MB/s)(13.3GiB/60001msec); 0 zone resets
    slat (nsec): min=2083, max=58396, avg=3376.74, stdev=1779.50
    clat (usec): min=87, max=2898, avg=547.49, stdev=72.34
     lat (usec): min=90, max=2901, avg=550.97, stdev=71.91
    clat percentiles (usec):
     |  1.00th=[  388],  5.00th=[  457], 10.00th=[  478], 20.00th=[  502],
     | 30.00th=[  519], 40.00th=[  529], 50.00th=[  545], 60.00th=[  553],
     | 70.00th=[  562], 80.00th=[  578], 90.00th=[  619], 95.00th=[  693],
     | 99.00th=[  807], 99.50th=[  824], 99.90th=[  881], 99.95th=[  906],
     | 99.99th=[ 1004]
   bw (  KiB/s): min=218912, max=256744, per=100.00%, avg=232102.40, stdev=7598.32, samples=120
   iops        : min=54728, max=64186, avg=58025.58, stdev=1899.56, samples=120
  lat (usec)   : 100=0.01%, 250=0.09%, 500=19.82%, 750=77.03%, 1000=3.05%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=8.30%, sys=19.80%, ctx=225126, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3481301,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=227MiB/s (238MB/s), 227MiB/s-227MiB/s (238MB/s-238MB/s), io=13.3GiB (14.3GB), run=60001-60001msec